---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarInSystem.GetBendData
source: html/4e97f9d9-2810-6573-9389-120d1edbd9c1.htm
---
# Autodesk.Revit.DB.Structure.RebarInSystem.GetBendData Method

Gets the RebarBendData, containing bar and hook information, of the instance.

## Syntax (C#)
```csharp
public RebarBendData GetBendData()
```

## Remarks
Internally, the bend data is used by many RebarShape methods to generate shape geometry.